//
//  TermsOfService.swift
//  ShisyutsuMemo
//
//  Created by yuki.tanaka on 2023/06/23.
//

import Foundation

struct TermsOfService {
    static let rawText = """
        # 利用規約

        この利用規約（以下、「本規約」）は、Yuki　Tanaka（以下、「当方」）が提供するアプリ「支出メモ」（以下、「本アプリ」）の利用条件を定めるものです。本アプリを利用される方（以下、「ユーザー」）には、本規約に従っていただくものとします。

        ## 1. 受諾
        本アプリをダウンロードし、利用することにより、本規約の全ての条項を受諾したものとみなします。

        ## 2. プライバシー
        当方は、本アプリの利用に関して得た個人情報を適切に取り扱います。詳細についてはプライバシーポリシーをご確認ください。

        ## 3. ユーザー情報の取得と利用
        本アプリは、ユーザーの支出情報を取得し、Realmのデータベースに保存します。
        また、Google AdMobの広告表示や、広告非表示の課金処理、Firebaseによる分析のため、ユーザーの情報を一部利用します。

        ## 4. 広告の表示
        本アプリでは、広告が表示されます。広告配信にはGoogle Admobを使用しています。

        ## 5. 利用料金
        本アプリの基本利用は無料です。ただし、将来的に広告非表示などの追加機能を有料で提供する可能性があります。

        ## 6. 禁止事項
        本アプリを利用するにあたり、以下の行為は禁止します。
        - 他人の情報を無断で記録する行為
        - 本アプリが提供するサービスを妨げる行為
        - 不正な目的でアプリを利用する行為
        - 法律または公序良俗に反する行為

        ## 7. 責任の限定
        当方は、本アプリの利用により生じた損害について、一切の責任を負わないものとします。また、本アプリの利用に関して生じたデータの紛失または破損に対しても、当方は一切の責任を負いません。

        ## 8. 本規約の変更
        当方は、必要に応じて本規約の内容を改定することがあります。改定後の規約は、本アプリ内で他の通知または告知を行うことなく、直ちに効力を生じるものとします。
        """
}
