//
//  TermsOfService.swift
//  ShisyutsuMemo
//
//  Created by yuki.tanaka on 2023/06/23.
//

import Foundation

struct TermsOfService {
    static let rawText = """
        # 利用規約
        この利用規約（以下、「本規約」）は、Yuki　Tanaka（以下、「当方」）が提供するアプリ「支出メモ」（以下、「本アプリ」）の利用条件を定めるものです。本アプリを利用される方（以下、「ユーザー」）には、本規約に従っていただくものとします。

        ## 1. 受諾
        本アプリをダウンロードし、利用することにより、本規約の全ての条項を受諾したものとみなします。

        ## 2. プライバシー
        当方は、本アプリの利用に関して得た個人情報を適切に取り扱います。詳細についてはプライバシーポリシーをご確認ください。

        ## 3. ユーザー情報の取得と利用
        本アプリは、ユーザーの支出情報を取得し、Realmのデータベースに保存します。
        また、Google AdMobの広告表示や、広告非表示の課金処理、Firebaseによる分析のため、ユーザーの情報を一部利用します。

        ## 4. 利用条件
        ユーザは、アプリを利用するに際し、情報端末（デバイス）、通信機器・手段、電力等をユーザ自らの責任と負担で準備・用意し、アプリ利用中は維持しなければならないものとする。
        ユーザは、当方が定める仕様基準（対応するOS、性能、機能等を含みますが、これらに限られません）に従わない限り、アプリを利用できない場合があることを予め了承します。

        ## 5. 広告の表示
        本アプリでは、広告が表示されます。広告配信にはGoogle Admobを使用しています。

        ## 6. 利用料金
        本アプリの基本利用は無料です。ただし、将来的に広告非表示などの追加機能を有料で提供する可能性があります。

        ## 7. 禁止事項
        本アプリを利用するにあたり、以下の行為は禁止します。
        - 他人の情報を無断で記録する行為
        - 本アプリが提供するサービスを妨げる行為
        - 不正な目的でアプリを利用する行為
        - 法律または公序良俗に反する行為

        ## 8. 非保証、免責
        1. 当方は、本アプリの利用により生じた損害について、一切の責任を負わないものとします。また、本アプリの利用に関して生じたデータの紛失または破損に対しても、当方は一切の責任を負いません。

        2.当方は本アプリの正確性、完全性、有効性、信頼性、安全性、適法性、特定の目的への適合性を含む、事実上又は法律上の一切の不具合がないことにつき、明示的にも黙示的にも保証は行いません。（なお、セキュリティ等への欠陥・エラー・バグがないことについても保証しません。）

        3.当方は、アプリについて次の事項について保証を行いません。
        - すべての情報端末に対応して正常に動作すること
        - OS又はバージョンアップ等が行われた場合において正常に動作すること
        - アプリストア等を含むプラットフォーマーの運用方針、規約等の変更が行われた場合において正常に動作すること

        4.当社はユーザに対し、前2項にかかる一切の不具合について、当社の責任と負担で当該不具合の解消を行うことを保証しません。

        ## 9. 本規約の変更
        当方は、必要に応じて本規約の内容を改定することがあります。改定後の規約は、本アプリ内で他の通知または告知を行うことなく、直ちに効力を生じるものとします。
        """
}
